"""
Задание 3.

Определить, какие из слов «attribute», «класс», «функция», «type»
невозможно записать в байтовом типе с помощью маркировки b'' (без encode decode).

Подсказки:
--- используйте списки и циклы, не дублируйте функции
--- обязательно!!! усложните задачу, "отловив" и обработав исключение,
придумайте как это сделать
"""

words = ['attribute', 'класс', 'функция', 'type']

for i in words:
    try:
        bytes_string = bytes(i, 'ascii')
        print(bytes_string, type(bytes_string), len(bytes_string))
    except UnicodeEncodeError as e:
        print(e)
